---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.UpdaterRegistry
source: html/824f2c8a-1f99-72be-4661-b613f0330bb3.htm
---
# UpdaterRegistry Members

Adds trigger with the specified element filter and ChangeType for all documents associated with this Updater